import tasks.Task01;
import tasks.Task02;
import tasks.Task04;

public class App {
    public static void main(String[] args) throws Exception {

        /*
         * Task_0️⃣1️⃣
         * Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который
         * вернет “перевернутый” список.
         * Task_0️⃣2️⃣
         * Реализуйте очередь с помощью LinkedList со следующими методами:enqueue() -
         * помещает элемент в конец очереди, dequeue() - возвращает первый элемент из
         * очереди и удаляет его, first() - возвращает первый элемент из очереди, не
         * удаляя.
         * Task_0️⃣3️⃣*
         * В калькулятор добавьте возможность отменить последнюю
         * операцию. Калькулятор сделать на основе программы разработанной на семинаре.
         * Task_0️⃣4️⃣*
         * Реализовать стэк с помощью массива. Нужно реализовать
         * методы: size(), empty(), push(), peek(), pop().
         */

        // Task01.run();
        // Task02.run();
        Task04.run();

    }
}
